In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [5]:
ser1 = Series(np.arange(3),index=['A','B','C'])

ser1 = 2*ser1

ser1

A    0
B    2
C    4
dtype: int64

In [6]:
ser1['B']

2

In [7]:
ser1[1]

2

In [8]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [9]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [10]:
ser1[ser1>3]

C    4
dtype: int64

In [12]:
ser1[ser1>3] = 10

ser1

A     0
B     2
C    10
dtype: int64

In [16]:
dframe = DataFrame(np.arange(25).reshape((5,5)),index=['BDG','DPS','CGK','PNK','SBY'],columns=['A','B','C','D','E'])

dframe

      A   B   C   D   E
BDG   0   1   2   3   4
DPS   5   6   7   8   9
CGK  10  11  12  13  14
PNK  15  16  17  18  19
SBY  20  21  22  23  24

In [18]:
dframe['B']

BDG     1
DPS     6
CGK    11
PNK    16
SBY    21
Name: B, dtype: int64

In [19]:
dframe[['B','E']]

      B   E
BDG   1   4
DPS   6   9
CGK  11  14
PNK  16  19
SBY  21  24

In [20]:
dframe[dframe['C']>8]

      A   B   C   D   E
CGK  10  11  12  13  14
PNK  15  16  17  18  19
SBY  20  21  22  23  24

In [21]:
dframe

      A   B   C   D   E
BDG   0   1   2   3   4
DPS   5   6   7   8   9
CGK  10  11  12  13  14
PNK  15  16  17  18  19
SBY  20  21  22  23  24

In [22]:
dframe > 10

         A      B      C      D      E
BDG  False  False  False  False  False
DPS  False  False  False  False  False
CGK  False   True   True   True   True
PNK   True   True   True   True   True
SBY   True   True   True   True   True